Autodesk.Revit.DB.DialogOptions.SynchronizeWithCentralDialogOptions.IsUpdatePartitionsSetCentralPath
Since:
2027

Autodesk.Revit.DB.DialogOptions.SynchronizeWithCentralDialogOptions.PartitionsSetCentralPath
Since:
2027

Autodesk.Revit.DB.DialogOptions.SynchronizeWithCentralDialogOptions.IsSaveLocalBeforeAndAfterSTC
Returns true if the dialog is for saving local before and after STC.
Since:
2027

Autodesk.Revit.DB.DialogOptions.SynchronizeWithCentralDialogOptions.IsCurrentProjectCentralModel
Returns true if the dialog is for getting central model.
Since:
2027

Autodesk.Revit.DB.DialogOptions.SynchronizeWithCentralDialogOptions.GetCentralLocation
Gets the central location.
Since:
2027

Autodesk.Revit.DB.DialogOptions.SynchronizeWithCentralDialogOptions.GetSyncEnableOptions
Gets the options.
Since:
2027

Autodesk.Revit.DB.DialogOptions.SynchronizeWithCentralDialogOptions.GetSyncOptions
Gets the options.
Since:
2027

Autodesk.Revit.DB.DialogOptions.SynchronizeWithCentralDialogOptions
The specific class for SynchronizeWithCentral dialog options as the input for ManagedCallEventArgs.
Since:
2027